<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 6 changes.</summary>

```diff
+ time_rotating.rotate_tailnet_key will be created
~ module.coreos-periphery-vm.data.ct_config.fedora-coreos-config will be read during apply
# (config refers to values not yet known)
! module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
+ module.coreos-periphery-vm.terraform_data.fedora_coreos_config will be created
+ module.tailscale_butane.terraform_data.butane_snippet will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 0 to change, 2 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-14T00:50:56Z [(view log)](https://github.com/perchnet/p/actions/runs/16255387885/job/45890919994#step:9:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # time_rotating.rotate_tailnet_key will be created
  + resource "time_rotating" "rotate_tailnet_key" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_minutes = 60
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.coreos-periphery-vm.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = (sensitive value)
      + strict       = true
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "685a3d9b.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/685a3d9b.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
          ~ file_name = "685a3d9b.butane-ci-user-data.ign" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.1.129",
            ],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fdfd:3a:a7ff::a9d",
              - "fdfd:3a:a7ff:0:2a75:d817:8e87:75d2",
              - "2600:4808:6170:3a00:5bcd:94f3:4a2b:f51e",
              - "fe80::2acb:a386:3641:2be2",
            ],
          - [
              - "fe80::12c2:368d:f23e:a7f",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:F0:91:70",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                    = "coreos-periphery-test"
      ~ network_interface_names = [
          - "lo",
          - "ens18",
          - "tailscale0",
        ] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/685a3d9b.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:F0:91:70" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.coreos-periphery-vm.terraform_data.fedora_coreos_config will be created
  + resource "terraform_data" "fedora_coreos_config" {
      + id     = (known after apply)
      + input  = (sensitive value)
      + output = (known after apply)
    }

  # module.tailscale_butane.terraform_data.butane_snippet will be created
  + resource "terraform_data" "butane_snippet" {
      + id               = (known after apply)
      + input            = (sensitive value)
      + output           = (known after apply)
      + triggers_replace = (sensitive value)
    }

Plan: 5 to add, 0 to change, 2 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-33-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->